# CurtainWallPanelsWidth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CurtainWallPanelsWidth Property
ParameterTypeId Class See Also
---
"Width"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CurtainWallPanelsWidth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurtainWallPanelsWidth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CurtainWallPanelsWidth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace